Revit 2024 API
FilledRegionType.IsValidBackgroundPatternId Method
 Check if the id is valid for a background pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsValidBackgroundPatternId(
	ElementId patternId
)
Visual Basic
Public Function IsValidBackgroundPatternId ( _
	patternId As ElementId _
) As Boolean
Visual C++
public:
bool IsValidBackgroundPatternId(
	ElementId^ patternId
)
Parameters
patternId
Type: Autodesk.Revit.DB.ElementId
 Element id of the FillPatternElement
Return Value
 False if the FillPatternElement is a model pattern. True otherwise.
Remarks
 The FillPatternElement must be a 'Drafting' pattern.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace